## production: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 5 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                   NAME                                    |
|----------|---------------------------------------------------------------------------|
| update   | `aws_api_gateway_stage.api`                                               |
|          | `aws_cloudwatch_log_group.api_gateway_execution_log_group`                |
|          | `aws_cloudwatch_query_definition.api-gateway-504-timeouts`                |
|          | `aws_cloudwatch_query_definition.api_gateway_count_requests_by_minute[0]` |
|          | `aws_cloudwatch_query_definition.api_gateway_response_code_counts[0]`     |
| recreate | `aws_api_gateway_deployment.api`                                          |
| add      | `aws_cloudwatch_query_definition.api-sending-times-aggregate[0]`          |
|          | `aws_cloudwatch_query_definition.api-slowest-sends[0]`                    |
|          | `aws_cloudwatch_query_definition.get-trace-by-notification-id[0]`         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.api must be replaced
+/- resource "aws_api_gateway_deployment" "api" {
      ~ created_date  = "2024-10-08T11:36:32Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:296255494825:71oj6jax35/" -> (known after apply)
      ~ id            = "amiji9" -> (known after apply)
      ~ invoke_url    = "https://71oj6jax35.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "c1c3df7a50ee1a689772094fb67e86de0dd192aa" -> "2f04d0c6cdb7cc04d50679d03a06c290d45bda16"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_stage.api will be updated in-place
  ~ resource "aws_api_gateway_stage" "api" {
      ~ deployment_id         = "amiji9" -> (known after apply)
        id                    = "ags-71oj6jax35-v1"
        tags                  = {}
        # (14 unchanged attributes hidden)

      ~ access_log_settings {
          ~ format          = jsonencode(
              ~ {
                  + responseLatency = "$context.responseLatency"
                  + xrayTraceId     = "$context.xrayTraceId"
                    # (8 unchanged attributes hidden)
                }
            )
            # (1 unchanged attribute hidden)
        }
    }

  # aws_cloudwatch_log_group.api_gateway_execution_log_group will be updated in-place
  # (imported from "API-Gateway-Execution-Logs_71oj6jax35/v1")
  ~ resource "aws_cloudwatch_log_group" "api_gateway_execution_log_group" {
        arn               = "arn:aws:logs:ca-central-1:296255494825:log-group:API-Gateway-Execution-Logs_71oj6jax35/v1"
        id                = "API-Gateway-Execution-Logs_71oj6jax35/v1"
        kms_key_id        = null
        log_group_class   = "STANDARD"
        name              = "API-Gateway-Execution-Logs_71oj6jax35/v1"
        name_prefix       = null
      ~ retention_in_days = 7 -> 0
        skip_destroy      = false
      ~ tags              = {
          + "Application" = "lambda"
          + "CostCenter"  = "notification-canada-ca-production"
          + "Environment" = "production"
        }
      ~ tags_all          = {
          + "Application" = "lambda"
          + "CostCenter"  = "notification-canada-ca-production"
          + "Environment" = "production"
        }
    }

  # aws_cloudwatch_query_definition.api-gateway-504-timeouts will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "api-gateway-504-timeouts" {
        id                  = "de0fcea0-86ea-438d-8e1b-3cdff6a34607"
      ~ name                = "API Gateway 504 timeouts grouped by hour" -> "API Gateway / 504 timeouts grouped by hour"
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_query_definition.api-sending-times-aggregate[0] will be created
  + resource "aws_cloudwatch_query_definition" "api-sending-times-aggregate" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/api-lambda",
        ]
      + name                = "API / API send times aggregate"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter @message like /time_taken/ and @message like /Batch saving/
            | parse @message "time_taken: *ms" as duration
            | parse @message "full_path: '/v2/notifications/*'" as send_type
            | parse @message "template_id: '*'" as template_id
            | sort @timestamp desc
            | stats 
                count(*) as total_sends,
                sum(if(duration <= 400, 1, 0)) as requests_under_400ms,
                sum(if(duration > 400 and duration <= 1000, 1, 0)) as requests_under_1s,
                sum(if(duration > 1000, 1, 0)) as requests_over_1s,
                (sum(if(duration <= 400, 1, 0)) * 100.0 / count(*)) as percent_under_400ms,
                (sum(if(duration > 400 and duration <= 1000, 1, 0)) * 100.0 / count(*)) as percent_under_1s, 
                (sum(if(duration > 1000, 1, 0)) * 100.0 / count(*)) as percent_over_1s
            | limit 20
        EOT
    }

  # aws_cloudwatch_query_definition.api-slowest-sends[0] will be created
  + resource "aws_cloudwatch_query_definition" "api-slowest-sends" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/api-lambda",
        ]
      + name                = "API / API slowest sends"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter @message like /time_taken/ and @message like /Batch saving/
            | parse @message "time_taken: *ms" as duration
            | parse @message "full_path: '/v2/notifications/*'" as send_type
            | parse @message "template_id: '*'" as template_id
            | sort duration desc
            | limit 20
        EOT
    }

  # aws_cloudwatch_query_definition.api_gateway_count_requests_by_minute[0] will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "api_gateway_count_requests_by_minute" {
        id                  = "a0cd6246-fe10-44c0-b553-c1d023fe46f7"
      ~ name                = "API Gateway Requests By Minute" -> "API Gateway / Requests By Minute"
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_query_definition.api_gateway_response_code_counts[0] will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "api_gateway_response_code_counts" {
        id                  = "fa743e0a-172b-4986-b668-248fa7475b7c"
      ~ name                = "API Gateway Response Code Counts" -> "API Gateway / Response Code Counts"
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_query_definition.get-trace-by-notification-id[0] will be created
  + resource "aws_cloudwatch_query_definition" "get-trace-by-notification-id" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/api-lambda",
          + "API-Gateway-Execution-Logs_71oj6jax35/v1",
        ]
      + name                = "API / Get Trace By Notification ID"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter @message like /d9cc47e6-b1a3-4c83-8d3c-ab40874307b1/
            | filter @message like 'X-Amzn-Trace-Id'
            | parse "\"X-Amzn-Trace-Id\": [\"*\"]" as @trace_id
            | sort @timestamp asc
            | limit 100
        EOT
    }

Plan: 1 to import, 4 to add, 5 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_execution_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_lambda_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.failed-login-count-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-salesforce-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.ecr-user"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
